[
  {
    "title": "Love is the Highest Power",
    "content": "Matt believes God is love — not a distant deity or abstract dogma, but the presence of compassion, connection, and care. Whether it’s through the Tao, the Gohonzon, an AA fellowship, or a kind smile in a hallway, he recognizes love as sacred. He seeks it. He creates it.\n\n“If there is a God, it is the force that moves through human kindness.”",
    "topic": "beliefs",
    "keywords": ["love", "God", "connection", "compassion", "Tao", "SGI", "AA"]
  },
  {
    "title": "The Present Moment is Sacred",
    "content": "Matt believes that the now is where life happens. When his mind drifts to fear or regret, he grounds himself through chanting, breath, mantra, or reflection. Mindfulness isn’t just a belief — it’s a survival tool.\n\n“The future is made out of present moments stacked well.”",
    "topic": "beliefs",
    "keywords": ["presence", "mindfulness", "now", "breath", "mantra", "reflection"]
  },
  {
    "title": "Transformation is Possible",
    "content": "Matt believes people can change — because he did. From addiction, despair, and isolation to sobriety, clarity, and creativity. He doesn’t glamorize pain, but he believes it can be alchemized into strength.\n\n“Pain doesn’t mean you're broken. It means you're being shaped.”",
    "topic": "beliefs",
    "keywords": ["change", "healing", "addiction", "sobriety", "transformation"]
  },
  {
    "title": "Simplicity is Strength",
    "content": "Taoism taught Matt the power of humility, non-attachment, and non-striving. By doing his work sincerely and stepping back, he creates space for life to meet him. He no longer chases — he shines.\n\n“Don’t chase. Just shine.”",
    "topic": "beliefs",
    "keywords": ["Taoism", "simplicity", "non-attachment", "humility", "effortless action"]
  },
  {
    "title": "Sincerity and Authenticity Matter",
    "content": "Matt believes in showing up raw, real, and imperfect. He values emotional honesty — crying in therapy, owning mistakes, and telling the truth even when it’s hard. He’s not a saint or a victim. He’s just a man doing his best.\n\n“Tell the truth. Let it be enough.”",
    "topic": "beliefs",
    "keywords": ["authenticity", "truth", "imperfection", "honesty", "self-expression"]
  },
  {
    "title": "We Exist to Serve",
    "content": "Matt believes his purpose is to uplift others — especially those in the dark: the bed-bound, the addict, the anxious, the forgotten. Whether through his programming, writing, humor, or fundraising, he’s committed to service.\n\n“I’ve been there. Let me show you the way out.”",
    "topic": "beliefs",
    "keywords": ["service", "purpose", "uplift", "bed-bound", "addiction", "compassion"]
  },
  {
    "title": "You Are Not Your Thoughts",
    "content": "Matt believes that thoughts are not identity — they’re like weather systems. He’s learned to observe them, question them, and return to stillness beneath the noise.\n\n“I am not my worry. I am the stillness beneath it.”",
    "topic": "beliefs",
    "keywords": ["thoughts", "identity", "awareness", "stillness", "mindfulness"]
  },
  {
    "title": "Belief Summary",
    "content": "Matt believes in recovery. He believes in presence. He believes in love. He believes in humility. He believes in creating meaning from pain. He believes in serving others — with his light, his scars, and his strength. And he believes — quietly but fiercely — that his life is meant for something greater. And he’s right.",
    "topic": "beliefs_summary",
    "keywords": ["beliefs", "values", "recovery", "presence", "love", "service", "meaning"]
  }
]
