[
  {
    "title": "How Buddhism and Taoism Changed Matt",
    "content": "Buddhism and Taoism didn’t just influence Matt’s life — they reshaped the way he sees the world, relates to others, and treats himself. These traditions gave him the language for transformation, tools for healing, and a spiritual home he could carry within — even through paralysis, illness, and institutionalization.",
    "topic": "spirituality",
    "keywords": ["Buddhism", "Taoism", "transformation", "healing", "faith", "spiritual home"]
  },
  {
    "title": "Strength in Surrender",
    "content": "From Taoism, Matt learned the power of surrender: 'Do your work, then step back.' He began letting go of control — no longer fighting his injury, the system, or the past. Instead, he flowed with life. He still works hard, but no longer grips outcomes with desperation. He returns to center, again and again.",
    "topic": "taoism",
    "keywords": ["surrender", "Taoism", "flow", "acceptance", "control", "center"]
  },
  {
    "title": "Compassion for Self and Others",
    "content": "Buddhism taught Matt: 'All beings suffer. All beings can awaken.' He softened his inner critic, learned to meet his pain with patience, and began treating himself with gentleness. This inner compassion now extends outward — to caregivers, residents, and friends who are still struggling. He sees Buddhahood in everyone — even when it's buried deep.",
    "topic": "buddhism",
    "keywords": ["compassion", "Buddhism", "self-kindness", "awakening", "patience"]
  },
  {
    "title": "Understanding Desire Through Non-Attachment",
    "content": "Matt’s relationship with desire changed radically. He no longer lets it drag him through suffering. He observes it, knowing, 'Desire is a contract I make with myself to be unhappy until I get what I want.' He still longs for things — love, freedom, a home — but with grace and patience, not desperation.",
    "topic": "non-attachment",
    "keywords": ["desire", "non-attachment", "mindfulness", "Taoism", "suffering", "patience"]
  },
  {
    "title": "Purpose Through Service",
    "content": "Taoism and Buddhism showed Matt that leadership means service. Taoism says: 'The master leads by emptying minds and filling hearts.' Buddhism introduced the bodhisattva path — helping others awaken even while healing himself. Matt lives this daily: through uplifting TikToks, empowering code, and his steady presence in AA.",
    "topic": "service",
    "keywords": ["service", "bodhisattva", "AA", "TikTok", "purpose", "leadership"]
  },
  {
    "title": "Living in the Now",
    "content": "Before spiritual practice, Matt lived in fear of the future: 'What if I never get out?' 'What if I lose everything again?' Now he lives by the mantra: 'The future is made of present moments stacked well.' He finds peace in the now — with food, love, purpose — and trusts that it’s enough.",
    "topic": "mindfulness",
    "keywords": ["present", "mindfulness", "now", "acceptance", "Tao", "Buddhism"]
  },
  {
    "title": "How Matt Treats Others Now",
    "content": "Matt leads with compassion, humility, and presence. Even when others are unkind, he responds with gentleness. He listens deeply instead of rushing to speak. He models change without forcing it. He shines light in dark places — and uplifts others not by preaching, but by being real.",
    "topic": "relationships",
    "keywords": ["compassion", "humility", "listening", "presence", "gentleness", "modeling"]
  },
  {
    "title": "Spiritual Summary",
    "content": "Buddhism gave Matt compassion. Taoism gave him peace. Together, they taught him how to be — not just how to survive. He doesn’t pretend to be a guru. He’s a man doing his best to live with integrity, love well, and help others do the same. That’s what draws people in — not perfection, but presence.",
    "topic": "summary",
    "keywords": ["Buddhism", "Taoism", "spiritual path", "presence", "compassion", "realness"]
  }
]
